update: refinded readme
